{
    "name": "Dimetrodon",
    "tier": 3,
    "type": "carnivores",
    "is_omnivore": false,
    "source": "Goliath's Dimetrodon",
    "limitations": [
        {
            "operator": "AND",
            "limitations": [
                {
                    "ages": [
                        "Adolescent",
                        "Adult",
                        "Subadult"
                    ],
                    "size": 3,
                    "species": "Any"
                },
                {
                    "ages": [
                        "Hatchling",
                        "Juvenile"
                    ],
                    "size": "Unlimited",
                    "species": "Any"
                }
            ]
        }
    ],
    "behaviors": [
        "They can be seen either basking in the sun upon rocks to soak up the sun with their sail, or navigating the shores of small lakes and rivers. Seeking respite from the heat, they occasionally immerse in the water, taking a refreshing dip before returning to its preferred sunning spot. ",
        "Not picky about what they eat, they may resort to cannibalizing smaller members of its own species, or favoring midsized herbivores for easier meals. However, if desperate or needing to feed their young, they won't shy away from hunting other carnivores. ",
        "They inhabit compact familial units termed a \"fleet,\" typically composed of younger Dimetrodon, or its mates, and offspring. These groups exhibit strong territorial tendencies, engaging in frequent confrontations and sibling rivalries to establish dominance as \"admiral\" of the fleet.",
        "They are notably vocal, particularly during hunting while collaborating with their fleet, all the while using its formidable claws and ripping fangs to collectively bleed out and wear down prey."
    ],
    "rules": [],
    "compatibleSpecies": [],
    "incompatibleSpecies": [],
    "updated_at": "",
    "credit": [
        "jekyde",
        "sizablerat"
    ]
}